Tekla.Structures.CatalogInternal.RebarHandler
The Tekla.Structures.CatalogInternal.RebarHandler class handles the data operations for rebars.

Tekla.Structures.CatalogInternal.RebarHandler.Singleton
The singleton instance.

Tekla.Structures.CatalogInternal.RebarHandler.rebarItems
The rebar items.

Tekla.Structures.CatalogInternal.RebarHandler.meshItems
The mesh items.

Tekla.Structures.CatalogInternal.RebarHandler.#ctor
Prevents a default instance of the Tekla.Structures.CatalogInternal.RebarHandler class from being created.

Tekla.Structures.CatalogInternal.RebarHandler.Instance
Gets the instance.

Tekla.Structures.CatalogInternal.RebarHandler.GetCatalogItem(System.String,System.String,System.Double)
Gets the rebar catalog item having best match to given bending radius.
grade: Rebar grade.
size: Rebar size.
radius: Bending radius.
Returns: The rebar catalog item having best match to given bending radius.

Tekla.Structures.CatalogInternal.RebarHandler.GetRebarItemsFromFile(System.String)
Returns the list of rebar items.
FilePath: File path of rebar database.
Returns: The list of rebar items.

Tekla.Structures.CatalogInternal.RebarHandler.GetAvailableDiameters(Tekla.Structures.Model.Reinforcement)
Gets available diameters.
rebar: The rebar.
Returns:
The available diameters.

Tekla.Structures.CatalogInternal.RebarHandler.GetAvailableDiameters(System.String)
Gets available diameters.
grade: The grade.
Returns:
The available diameters.

Tekla.Structures.CatalogInternal.RebarHandler.GetAvailableRadiuses(Tekla.Structures.Model.Reinforcement)
Gets available radiuses.
rebar: The rebar.
Returns:
The available radiuses.

Tekla.Structures.CatalogInternal.RebarHandler.GetMeshItems
Gets the mesh items.
Returns:
The the mesh items.

Tekla.Structures.CatalogInternal.RebarHandler.ApplyNewRebarSize(System.String,System.String,System.String,System.Collections.ArrayList,Tekla.Structures.Model.RebarHookData,Tekla.Structures.Model.RebarHookData)
Applies the new standard values (if any) to radius values and hooks according to the new size.
grade: Grade of material.
oldSize: Old size.
newSize: New size.
radiuses: Bending radius values.
startHook: Start hook.
endHook: End hook.
Returns: True when succesfull, otherwise false.

Tekla.Structures.CatalogInternal.RebarHandler.SetMeshSizeAndOverhangs(Tekla.Structures.Catalogs.MeshItem)
Sets mesh size and overhangs.
item: The item.

Tekla.Structures.CatalogInternal.RebarHandler.GetOverhangRight(System.Double,System.Double)
Gets the right overhang.
totalDistance: The total distance.
unitDistance: The unit distance.
Returns: The right overhang.

Tekla.Structures.CatalogInternal.RebarHandler.GetTotalLength(System.Double,System.Double,System.String)
Gets total length.
leftOverhang: The left overhang.
rightOverhang: The right overhang.
distance: The distance.
Returns: The total length.The double.

Tekla.Structures.CatalogInternal.RebarHandler.IsVaryingSpacingValueString(Tekla.Structures.Catalogs.MeshItem)
Determines whether the item has varying spacing values.
item: The item.
Returns:
true if the item has varying spacing values; otherwise, false.